## Python Pandas Excel 学习群: 366719470
## Ask And Answer 问答
## AAA008 索引对齐相减

In [24]:
import pandas as pd

In [25]:
df1 = pd.DataFrame([
    ['c', 3],
    ['a', 2],
    ['b', 7],
    ['d', 6]
], columns=['A', 'B'])

In [26]:
df2 = pd.DataFrame([
    ['b', 5],
    ['c', 3],
    ['d', 9],
    ['e', 1],
    ['f', 8]
], columns=['A', 'B'])

In [27]:
df1

   A  B
0  c  3
1  a  2
2  b  7
3  d  6

In [28]:
df2

   A  B
0  b  5
1  c  3
2  d  9
3  e  1
4  f  8

In [30]:
(df1.set_index('A') - df2.set_index('A')).reset_index()

   A    B
0  a  NaN
1  b  2.0
2  c  0.0
3  d -3.0
4  e  NaN
5  f  NaN